In [1]:
import numpy as np
labels = ["apple", "banana", "cherry", "date", "elderberry"]
values = [10, 20, 30, 40, 50]
arr = np.array([1.1, 2.2, 3.3, 4.4, 5.5])
info = {
    "name": "Anish",
    "age": 23,
    "city": "Pokhara",
    "is_student": True
}

print("labels:", labels)
print("values:", values)
print("arr:", arr)
print("info:", info)

labels: ['apple', 'banana', 'cherry', 'date', 'elderberry']
values: [10, 20, 30, 40, 50]
arr: [1.1 2.2 3.3 4.4 5.5]
info: {'name': 'Anish', 'age': 23, 'city': 'Pokhara', 'is_student': True}

In [2]:
# Create a new python series that stores the population of 5 various cities as data and name of the cities as indexes from data given below. Store it in variable cities_population.
# indexes = ['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh']
# data = [200000, 1600000, 600000, 500000, 350000]


import pandas as pd


indexes = ['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh']
data = [200000, 1600000, 600000, 500000, 350000]


cities_population = pd.Series(data, index=indexes)


print(cities_population)

Biratnagar      200000
Kathmandu      1600000
Lalitpur        600000
Pokhara         500000
Narayangarh     350000
dtype: int64

In [ ]:
# Create different python series for each question below out of the data above as follows:
# Using python list data_values_1. What do you observe regarding the indexes?
# Using python list data_labels_1. What do you observe regarding the datatype of the series?
# Using data_values_1 as data values and data_labels_1 as indexes
# Using numpy array series_numpy_array_1.
# Using numpy array series_numpy_array_1. Set the indexes to data_labels_1.
# Using python dictionary dict2. What do you observe regarding the indexes?

import pandas as pd
import numpy as np

data_values_1 = [10, 20, 30, 40, 50]
data_labels_1 = ["apple", "banana", "cherry", "pineapple", "elderberry"]
series_numpy_array_1 = np.array([1.1, 2.2, 3.3, 4.4, 5.5])
dict2 = {"name": "Anish", "age": 23, "city": "Pokhara", "is_student": True}

series1 = pd.Series(data_values_1)
print("\nSeries using data_values_1:")
print(series1)
print("Observation: The indexes are automatically assigned as integers (0,1,2,3,4).")

# 2. Series using data_labels_1
series2 = pd.Series(data_labels_1)
print("\nSeries using data_labels_1:")
print(series2)
print("Observation: The data type of the Series is 'object' because it contains strings.")

# 3. Series using data_values_1 as values and data_labels_1 as indexes
series3 = pd.Series(data_values_1, index=data_labels_1)
print("\nSeries using data_values_1 as values and data_labels_1 as indexes:")
print(series3)
print("Observation: The indexes are now custom labels instead of default integer indexes.")

# 4. Series using series_numpy_array_1
series4 = pd.Series(series_numpy_array_1)
print("\nSeries using series_numpy_array_1:")
print(series4)
print("Observation: The default indexes are integers, and the data type is float.")

# 5. Series using series_numpy_array_1 with data_labels_1 as indexes
series5 = pd.Series(series_numpy_array_1, index=data_labels_1)
print("\nSeries using series_numpy_array_1 with data_labels_1 as indexes:")
print(series5)
print("Observation: The indexes are now the labels from data_labels_1 instead of integers.")

# 6. Series using dictionary dict2
series6 = pd.Series(dict2)
print("\nSeries using dictionary dict2:")
print(series6)
print("Observation: The keys of the dictionary become the indexes of the Series.")

Series using data_values_1:
0    10
1    20
2    30
3    40
4    50
dtype: int64
Observation: The indexes are automatically assigned as integers (0,1,2,3,4).

Series using data_labels_1:
0         apple
1        banana
2        cherry
3     pineapple
4    elderberry
dtype: object
Observation: The data type of the Series is 'object' because it contains strings.

Series using data_values_1 as values and data_labels_1 as indexes:
apple         10
banana        20
cherry        30
pineapple     40
elderberry    50
dtype: int64
Observation: The indexes are now custom labels instead of default integer indexes.

Series using series_numpy_array_1:
0    1.1
1    2.2
2    3.3
3    4.4
4    5.5
dtype: float64
Observation: The default indexes are integers, and the data type is float.

Series using series_numpy_array_1 with data_labels_1 as indexes:
apple         1.1
banana        2.2
cherry        3.3
pineapple     4.4
elderberry    5.5
dtype: float64
Observation: The indexes are now the labels from data_labels_1 instead of integers.

Series using dictionary dict2:
name            Anish
age                23
city          Pokhara
is_student       True
dtype: object
Observation: The keys of the dictionary become the indexes of the Series.

In [48]:

# Fetch the indexes of the series cities_population.
import pandas as pd

# Given data
indexes = ['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh']
data = [200000, 1600000, 600000, 500000, 350000]

# Creating a Pandas Series
cities_population = pd.Series(data, index=indexes)

# Fetching the indexes
print("Indexes of the series:", cities_population.index)

Indexes of the series: Index(['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh'], dtype='object')

In [5]:

# Create a new python series that stores the population of 5 various cities as data and name of the cities as indexes from data given below. Store it in variable cities_population_2.
# indexes = ['Bhaktapur', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Butwal']
# data = [150000, 1600000, 600000, 500000, 300000]
import pandas as pd

# Given data
city_names = ['Bhaktapur', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Butwal']
populations = [150000, 1600000, 600000, 500000, 300000]

# Creating the Pandas Series
city_population_series = pd.Series(populations, index=city_names)

# Print the series
print(city_population_series)

Bhaktapur     150000
Kathmandu    1600000
Lalitpur      600000
Pokhara       500000
Butwal        300000
dtype: int64

In [ ]:
# Perform addition on series 'cities_population' and 'cities_population_2'. What do you observe?
import pandas as pd


cities_population = pd.Series(
    [200000, 1600000, 600000, 500000, 350000],
    index=['Biratnagar', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Narayangarh']
)


cities_population_2 = pd.Series(
    [150000, 1600000, 600000, 500000, 300000],
    index=['Bhaktapur', 'Kathmandu', 'Lalitpur', 'Pokhara', 'Butwal']
)


result = cities_population + cities_population_2


print(result)

Bhaktapur            NaN
Biratnagar           NaN
Butwal               NaN
Kathmandu      3200000.0
Lalitpur       1200000.0
Narayangarh          NaN
Pokhara        1000000.0
dtype: float64

In [8]:
# Create a pandas DataFrame out of the following data. Store it in the variable df_.
# serial_no: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] #row indexes
# subjects : ['ENG', 'NEP', 'MAT', 'SCI', 'COM'] #column headers
# students : ['RAM','SHYAM','GITA','HARI','SITA','SUSHILA','RAMESH','SUBODH','ANIL','RUPA']
# marks :marks =[[57, 34, 93, 84, 54], [48, 49, 52, 89, 64], [66, 64, 75, 38, 84], [55, 47, 90, 82, 37], [45, 93, 70, 53, 76], [45, 63, 33, 53, 72], [68, 34, 42, 43, 84], [62, 69, 67, 50, 94], [59, 33, 51, 68, 33], [57, 91, 60, 37, 44]]

import pandas as pd


serial_no = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]  # Row indexes
subjects = ['ENG', 'NEP', 'MAT', 'SCI', 'COM']  # Column headers
students = ['RAM', 'SHYAM', 'GITA', 'HARI', 'SITA', 'SUSHILA', 'RAMESH', 'SUBODH', 'ANIL', 'RUPA']
marks = [
    [57, 34, 93, 84, 54],
    [48, 49, 52, 89, 64],
    [66, 64, 75, 38, 84],
    [55, 47, 90, 82, 37],
    [45, 93, 70, 53, 76],
    [45, 63, 33, 53, 72],
    [68, 34, 42, 43, 84],
    [62, 69, 67, 50, 94],
    [59, 33, 51, 68, 33],
    [57, 91, 60, 37, 44]
]


df = pd.DataFrame(marks, index=serial_no, columns=subjects)

# Adding the student names as a new column
df["STUDENT"] = students


print(df)

    ENG  NEP  MAT  SCI  COM  STUDENT
1    57   34   93   84   54      RAM
2    48   49   52   89   64    SHYAM
3    66   64   75   38   84     GITA
4    55   47   90   82   37     HARI
5    45   93   70   53   76     SITA
6    45   63   33   53   72  SUSHILA
7    68   34   42   43   84   RAMESH
8    62   69   67   50   94   SUBODH
9    59   33   51   68   33     ANIL
10   57   91   60   37   44     RUPA

In [9]:
# Fetch the records of all the students who have passed in Nepali. 
# Define passing marks
passing_marks = 40

# Filter students who passed in Nepali
passed_nepali = df[df["NEP"] >= passing_marks]

# Print the records of students who passed in Nepali
print(passed_nepali)

    ENG  NEP  MAT  SCI  COM  STUDENT
2    48   49   52   89   64    SHYAM
3    66   64   75   38   84     GITA
4    55   47   90   82   37     HARI
5    45   93   70   53   76     SITA
6    45   63   33   53   72  SUSHILA
8    62   69   67   50   94   SUBODH
10   57   91   60   37   44     RUPA

In [10]:
# Fetch the names of all the students who have scored a first division mark in science.
# Note that a score of more than or equaly to 70 is First Division.  
# Define first division marks for Science
first_division_marks = 70

# Filter students who have scored first division marks in Science
first_division_science = df[df["SCI"] >= first_division_marks]

# Fetch the names of the students who have scored first division marks
student_names = first_division_science["STUDENT"]

# Print the names of students
print(student_names)

1      RAM
2    SHYAM
4     HARI
Name: STUDENT, dtype: object

In [2]:
import pandas as pd
b = pd.Series([2,3,-2,1],index=["d","b","a","c"]) #specify custom index
b

d    2
b    3
a   -2
c    1
dtype: int64

In [3]:
b[::2]

d    2
a   -2
dtype: int64

In [4]:
b[b>0] #filtering with a boolean array

d    2
b    3
c    1
dtype: int64

In [5]:
b*2

d    4
b    6
a   -4
c    2
dtype: int64

In [6]:
b

d    2
b    3
a   -2
c    1
dtype: int64

In [ ]:
import numpy as np # type: ignore
np.power(b,2) #applying math functions

d    4
b    9
a    4
c    1
dtype: int64

In [8]:
data = {"KTM":29,"PKR":24,"BRJ":33}
c = pd.Series(data)
c

KTM    29
PKR    24
BRJ    33
dtype: int64

In [9]:
cities = ["BRJ","KTM","PKR","ITA"]
d = pd.Series(data,index=cities)
d

BRJ    33.0
KTM    29.0
PKR    24.0
ITA     NaN
dtype: float64

In [10]:
pd.isnull(d)

BRJ    False
KTM    False
PKR    False
ITA     True
dtype: bool

In [11]:
pd.notnull(d)

BRJ     True
KTM     True
PKR     True
ITA    False
dtype: bool

In [12]:
d.isnull()

BRJ    False
KTM    False
PKR    False
ITA     True
dtype: bool

In [13]:
c

KTM    29
PKR    24
BRJ    33
dtype: int64

In [14]:
d

BRJ    33.0
KTM    29.0
PKR    24.0
ITA     NaN
dtype: float64

In [15]:
c+d

BRJ    66.0
ITA     NaN
KTM    58.0
PKR    48.0
dtype: float64

In [16]:
c.name="temperature"
c

KTM    29
PKR    24
BRJ    33
Name: temperature, dtype: int64

In [ ]:
c.index.name ="city"
d.index.name="temperature"
d

AttributeError: 'Series' object has no attribute 'value'

In [21]:
d

temperature
BRJ    33.0
KTM    29.0
PKR    24.0
ITA     NaN
dtype: float64

In [23]:
import pandas as pd
data = {'city':['KTM','KTM','PKR','PKR','BRJ','BRJ'],
       'day':['SUN','MON','SUN','MON','SUN','MON'],
       'temp':[23,22,25,26,30,31]}
df = pd.DataFrame(data)
df

  city  day  temp
0  KTM  SUN    23
1  KTM  MON    22
2  PKR  SUN    25
3  PKR  MON    26
4  BRJ  SUN    30
5  BRJ  MON    31

In [26]:
pd.DataFrame(data,columns=["day","city","temp"])

   day city  temp
0  SUN  KTM    23
1  MON  KTM    22
2  SUN  PKR    25
3  MON  PKR    26
4  SUN  BRJ    30
5  MON  BRJ    31

In [27]:
df

  city  day  temp
0  KTM  SUN    23
1  KTM  MON    22
2  PKR  SUN    25
3  PKR  MON    26
4  BRJ  SUN    30
5  BRJ  MON    31

In [29]:
df.columns

Index(['city', 'day', 'temp'], dtype='object')

In [30]:
df["city"]

0    KTM
1    KTM
2    PKR
3    PKR
4    BRJ
5    BRJ
Name: city, dtype: object

In [32]:
df2 = pd.DataFrame(data,columns=['day','city','temp','humidity'],
            index=['one','two','three','four','five','six'])
df2

       day city  temp humidity
one    SUN  KTM    23      NaN
two    MON  KTM    22      NaN
three  SUN  PKR    25      NaN
four   MON  PKR    26      NaN
five   SUN  BRJ    30      NaN
six    MON  BRJ    31      NaN

In [33]:
df2.loc['three'] #label based indexing

day         SUN
city        PKR
temp         25
humidity    NaN
Name: three, dtype: object

In [34]:
df2.iloc[0] #position based indexing

day         SUN
city        KTM
temp         23
humidity    NaN
Name: one, dtype: object

In [ ]:

df2["humidity"]=np.random.randint(2,10,6)
df2

       day city  temp  humidity
one    SUN  KTM    23         3
two    MON  KTM    22         9
three  SUN  PKR    25         8
four   MON  PKR    26         3
five   SUN  BRJ    30         9
six    MON  BRJ    31         9

In [37]:
df2['capital'] = df2['city'] == 'KTM' #assigning a column that doesn't exist will create a new column
df2

       day city  temp  humidity  capital
one    SUN  KTM    23         3     True
two    MON  KTM    22         9     True
three  SUN  PKR    25         8    False
four   MON  PKR    26         3    False
five   SUN  BRJ    30         9    False
six    MON  BRJ    31         9    False

In [38]:
del df2['capital'] #deleting a column, this will change the dataframe 
df2.columns

Index(['day', 'city', 'temp', 'humidity'], dtype='object')

In [39]:
df2.drop("one")

       day city  temp  humidity
two    MON  KTM    22         9
three  SUN  PKR    25         8
four   MON  PKR    26         3
five   SUN  BRJ    30         9
six    MON  BRJ    31         9

In [40]:
df2 #the dataframe is unchanged, drop returns a copy

       day city  temp  humidity
one    SUN  KTM    23         3
two    MON  KTM    22         9
three  SUN  PKR    25         8
four   MON  PKR    26         3
five   SUN  BRJ    30         9
six    MON  BRJ    31         9

In [44]:
df2.drop('one',inplace=True) #will change the origional dataframe

KeyError: "['one'] not found in axis"

In [45]:
df2

       day city  temp  humidity
two    MON  KTM    22         9
three  SUN  PKR    25         8
four   MON  PKR    26         3
five   SUN  BRJ    30         9
six    MON  BRJ    31         9

In [46]:
df2.drop(columns=['day','temp'])

      city  humidity
two    KTM         9
three  PKR         8
four   PKR         3
five   BRJ         9
six    BRJ         9

In [47]:
df2

       day city  temp  humidity
two    MON  KTM    22         9
three  SUN  PKR    25         8
four   MON  PKR    26         3
five   SUN  BRJ    30         9
six    MON  BRJ    31         9